Tekla Open API Reference for Tekla Structures 2025
CombinedDimensionAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes.CombinedDimensionAttributes()
 Creates a new combined dimension attributes instance. The defaults combine a minimum of three identical dimensions to be shown as the number of items times the length of the dimension.
DimensionSetBaseAttributes.CombinedDimensionAttributes(Int32, DimensionSetBaseAttributes.CombineFormats)
 Creates a new combined dimension attributes instance with the given parameters.
Top
See Also
Reference
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
Tekla.Structures.Drawing Namespace